  ### Deployment Results ✅

  **jcetina** successfully deployed branch `jcetina/bastion-vault` to **production**

  <details><summary>Show Results</summary>

  ```terraform
[command]/home/runner/work/_temp/c519d26d-9956-4b37-adfa-806f8e64a59c/terraform-bin apply -no-color -auto-approve -compact-warnings

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

# azurerm_network_interface.servers[0] has changed
~ resource "azurerm_network_interface" "servers" {
      id                            = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkInterfaces/server-nic-0"
    - internal_domain_name_suffix   = "r3i2mqcjbqhu1or22rlnvvahfe.bx.internal.cloudapp.net" -> null
      name                          = "server-nic-0"
      tags                          = {}
    - virtual_machine_id            = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Compute/virtualMachines/server-0" -> null
      # (9 unchanged attributes hidden)

      # (1 unchanged block hidden)
  }

# azurerm_network_interface.servers[1] has changed
~ resource "azurerm_network_interface" "servers" {
      id                            = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkInterfaces/server-nic-1"
    - internal_domain_name_suffix   = "r3i2mqcjbqhu1or22rlnvvahfe.bx.internal.cloudapp.net" -> null
      name                          = "server-nic-1"
      tags                          = {}
    - virtual_machine_id            = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Compute/virtualMachines/server-1" -> null
      # (9 unchanged attributes hidden)

      # (1 unchanged block hidden)
  }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

# azurerm_key_vault_access_policy.vault_access_policy will be updated in-place
~ resource "azurerm_key_vault_access_policy" "vault_access_policy" {
      id                      = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.KeyVault/vaults/bastion-vault-9c07ae1c/objectId/0d19abf9-dde1-46e6-b0b9-468e6c5da0aa"
    ~ key_permissions         = [
        - "Get",
        - "Update",
          "Create",
          "Delete",
        - "Recover",
        + "Get",
          "Purge",
        + "Recover",
        + "Update",
      ]
      # (6 unchanged attributes hidden)
  }

# azurerm_linux_virtual_machine.servers[0] will be created
+ resource "azurerm_linux_virtual_machine" "servers" {
    + admin_username                  = "adminuser"
    + allow_extension_operations      = true
    + computer_name                   = (known after apply)
    + disable_password_authentication = true
    + extensions_time_budget          = "PT1H30M"
    + id                              = (known after apply)
    + location                        = "eastus"
    + max_bid_price                   = -1
    + name                            = "server-0"
    + network_interface_ids           = [
        + "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkInterfaces/server-nic-0",
      ]
    + patch_mode                      = "ImageDefault"
    + platform_fault_domain           = -1
    + priority                        = "Regular"
    + private_ip_address              = (known after apply)
    + private_ip_addresses            = (known after apply)
    + provision_vm_agent              = true
    + public_ip_address               = (known after apply)
    + public_ip_addresses             = (known after apply)
    + resource_group_name             = "org-jcetina-repo-baklava-rg"
    + size                            = "Standard_F2"
    + virtual_machine_id              = (known after apply)

    + admin_ssh_key {
        + public_key = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDU9ROAKCxPE/2X6e1xEb6O47PUj5xutBV2czqOaUWIwV0HOAUhKQzHwupV4IA67uUw8gtg+Q7XZpC4ZrhXhEGEAXuyCRsqomQzdqYy1vjV9JUCspxM5861J4TiD25pLVX98nmCuN7qUsTY+UA0twPWzfOjVr/fXrZJUYeeSwV17zJzO9kwvDe7qHq5o0YhM/QoSsXgDkofzqzVJ/nzrdpFYgMgfJQfTjjyxrhZ5zfmhvPAagC+GATH5S/2a0DVkbD0q/3RiKYg5KmdMGjWlcNMuljAWP8q5AvZ7e9aMsr+N9wYF+ylXROJwhzjIknir3e000c+gkjx2PObcsI+Q75x"
        + username   = "adminuser"
      }

    + os_disk {
        + caching                   = "ReadWrite"
        + disk_size_gb              = (known after apply)
        + name                      = (known after apply)
        + storage_account_type      = "Standard_LRS"
        + write_accelerator_enabled = false
      }

    + source_image_reference {
        + offer     = "0001-com-ubuntu-server-focal"
        + publisher = "Canonical"
        + sku       = "20_04-lts"
        + version   = "latest"
      }

    + termination_notification {
        + enabled = (known after apply)
        + timeout = (known after apply)
      }
  }

# azurerm_linux_virtual_machine.servers[1] will be created
+ resource "azurerm_linux_virtual_machine" "servers" {
    + admin_username                  = "adminuser"
    + allow_extension_operations      = true
    + computer_name                   = (known after apply)
    + disable_password_authentication = true
    + extensions_time_budget          = "PT1H30M"
    + id                              = (known after apply)
    + location                        = "eastus"
    + max_bid_price                   = -1
    + name                            = "server-1"
    + network_interface_ids           = [
        + "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkInterfaces/server-nic-1",
      ]
    + patch_mode                      = "ImageDefault"
    + platform_fault_domain           = -1
    + priority                        = "Regular"
    + private_ip_address              = (known after apply)
    + private_ip_addresses            = (known after apply)
    + provision_vm_agent              = true
    + public_ip_address               = (known after apply)
    + public_ip_addresses             = (known after apply)
    + resource_group_name             = "org-jcetina-repo-baklava-rg"
    + size                            = "Standard_F2"
    + virtual_machine_id              = (known after apply)

    + admin_ssh_key {
        + public_key = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDU9ROAKCxPE/2X6e1xEb6O47PUj5xutBV2czqOaUWIwV0HOAUhKQzHwupV4IA67uUw8gtg+Q7XZpC4ZrhXhEGEAXuyCRsqomQzdqYy1vjV9JUCspxM5861J4TiD25pLVX98nmCuN7qUsTY+UA0twPWzfOjVr/fXrZJUYeeSwV17zJzO9kwvDe7qHq5o0YhM/QoSsXgDkofzqzVJ/nzrdpFYgMgfJQfTjjyxrhZ5zfmhvPAagC+GATH5S/2a0DVkbD0q/3RiKYg5KmdMGjWlcNMuljAWP8q5AvZ7e9aMsr+N9wYF+ylXROJwhzjIknir3e000c+gkjx2PObcsI+Q75x"
        + username   = "adminuser"
      }

    + os_disk {
        + caching                   = "ReadWrite"
        + disk_size_gb              = (known after apply)
        + name                      = (known after apply)
        + storage_account_type      = "Standard_LRS"
        + write_accelerator_enabled = false
      }

    + source_image_reference {
        + offer     = "0001-com-ubuntu-server-focal"
        + publisher = "Canonical"
        + sku       = "20_04-lts"
        + version   = "latest"
      }

    + termination_notification {
        + enabled = (known after apply)
        + timeout = (known after apply)
      }
  }

Plan: 2 to add, 1 to change, 0 to destroy.
azurerm_linux_virtual_machine.servers[0]: Creating...
azurerm_key_vault_access_policy.vault_access_policy: Modifying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.KeyVault/vaults/bastion-vault-9c07ae1c/objectId/0d19abf9-dde1-46e6-b0b9-468e6c5da0aa]
azurerm_linux_virtual_machine.servers[1]: Creating...
azurerm_key_vault_access_policy.vault_access_policy: Modifications complete after 9s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.KeyVault/vaults/bastion-vault-9c07ae1c/objectId/0d19abf9-dde1-46e6-b0b9-468e6c5da0aa]
azurerm_linux_virtual_machine.servers[0]: Still creating... [10s elapsed]
azurerm_linux_virtual_machine.servers[1]: Still creating... [10s elapsed]
azurerm_linux_virtual_machine.servers[0]: Still creating... [20s elapsed]
azurerm_linux_virtual_machine.servers[1]: Still creating... [20s elapsed]
azurerm_linux_virtual_machine.servers[0]: Still creating... [30s elapsed]
azurerm_linux_virtual_machine.servers[1]: Still creating... [30s elapsed]
azurerm_linux_virtual_machine.servers[0]: Still creating... [40s elapsed]
azurerm_linux_virtual_machine.servers[1]: Still creating... [40s elapsed]
azurerm_linux_virtual_machine.servers[0]: Creation complete after 49s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Compute/virtualMachines/server-0]
azurerm_linux_virtual_machine.servers[1]: Creation complete after 49s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Compute/virtualMachines/server-1]

Apply complete! Resources: 2 added, 1 changed, 0 destroyed.
```

  </details>